// 'use strict' - первая строчка в документа, нужна для того чтобы видны были ошибки

// типы данных

//number  обычные числа 1,2, + Infinity (+бесконечность), -Infinity(+бесконечность), 0.3 (через точку), NaN

//string строки  - 'dog', "cat", `cow`
//boolean - true, false
//object -{}(литералы), [](масивы), null(относится к объекту, но не объект)
//undefined - undefined(ничего)

//null =0 (хотим чтобы что-то было, но пока там ничего нет)
//bigInt - 1n
//symbol - {}
//typeof null => 'object'   (typeof typeof null)=> 'string'
// математические операторы +, -, /, *, ** (возвести в степень), %( остаток от деления)б, = (знак присваевания), ==, ===

// способы объявления переменных var, let(пусть, можно переписать переменные), const(нельзя переписать переменную)
//const num = 1; numFirst - имя, может быть любое(каждое последующее слово с большой буквы)
//const numFirst = 1;
let numFirst = 1;
numFirst = "akjhcskjshjk";

var dog = "Bim";

dog = 1;

console.log(dog);
